measure-theory/notes/scratch.tex
% Created 2026-04-02 Thu 13:40
% Intended LaTeX compiler: lualatex
\documentclass[a4paper, 11pt]{article}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{fontspec}
\directlua{luaotfload.add_fallback("mainfallback", {
  "TeX Gyre Termes:mode=node;",
  "Apple Color Emoji:mode=harf;",
})}
\setmainfont{Latin Modern Roman}[Ligatures=TeX, RawFeature={fallback=mainfallback}]
\setmonofont{Menlo}[Scale=0.9]
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage{hyperref}

% Paragraph heading formatting (for deep headline levels)
\usepackage{titlesec}
\titleformat{\paragraph}{\normalfont\normalsize\bfseries}{\theparagraph}{1em}{}
\titlespacing*{\paragraph}{0pt}{2.5ex plus 1ex minus .2ex}{1ex plus .2ex}
\setcounter{secnumdepth}{6}
\setcounter{tocdepth}{6}

% Paragraph spacing (no indent, vertical skip between paragraphs)
\usepackage[skip=10pt, indent=0pt]{parskip}

% Page margins
\usepackage[top=20mm,bottom=20mm,left=20mm,right=20mm]{geometry}

% List formatting
\usepackage{enumitem}
\setlist[description]{leftmargin=!,labelwidth=1.5em,itemindent=0pt}
\setlist[itemize]{leftmargin=1.5em,topsep=0pt}

\usepackage{amsfonts}
\usepackage{amssymb}
\usepackage{gensymb}
\setlength{\headheight}{13.59999pt}
\definecolor{linkblue}{HTML}{00007B}
\definecolor{exampleblue}{HTML}{4169E1}
\definecolor{highlightred}{HTML}{B22222}
\definecolor{highlightblue}{HTML}{0000FF}
\definecolor{notegray}{HTML}{7F807F}
\definecolor{highlightsalmon}{HTML}{F08080}
\definecolor{highlightgreen}{HTML}{006400}
\definecolor{examplebarbg}{rgb}{0.255, 0.41, 0.884}
\usepackage{amsthm}
\usepackage{mathtools}
\usepackage{thmtools}
\usepackage{mathrsfs}
\usepackage{bm}
\usepackage{fancyhdr}
\pagestyle{fancy}
\fancyhf{}
\lhead{\textit{A.B}}
\rhead{\thepage}
\renewcommand{\headrulewidth}{0pt}
\usepackage{tikz}
\usepackage{caption}
\usetikzlibrary{arrows.meta, positioning, shapes.geometric, calc}
\usepackage{mdframed}
\usepackage[bottom]{footmisc}
\setlength{\parskip}{0pt plus 1pt}
\usepackage{titlesec}
\titleformat{\section}{\normalfont\normalsize\centering}{\thesection}{1em}{\scshape}
\titleformat{\subsection}{\normalfont\bfseries\fontsize{12}{14.4}\selectfont}{\thesubsection}{1em}{}
\titleformat{\subsubsection}{\normalfont\bfseries}{\thesubsubsection}{1em}{}
\newtheoremstyle{italicbody}{3pt}{3pt}{\itshape}{}{\bfseries}{.}{ }{}
\newtheoremstyle{uprightbody}{3pt}{3pt}{}{}{\bfseries}{.}{ }{}
\theoremstyle{italicbody}
\newtheorem{theorem}{Theorem}[subsection]
\newtheorem{lemma}{Lemma}[subsection]
\newtheorem{corollary}{Corollary}[subsection]
\newtheorem{proposition}{Proposition}[subsection]
\theoremstyle{uprightbody}
\newtheorem{definition}{Definition}[subsection]
\newtheorem{examplesinner}{Examples}[subsection]
\newtheorem{remark}{Remark}[subsection]
\newtheorem{result}{Result}[subsection]
\newmdenv[leftline=true,rightline=false,topline=false,bottomline=false,linewidth=3pt,linecolor=examplebarbg,innerleftmargin=10pt,innerrightmargin=0pt,innertopmargin=2pt,innerbottommargin=2pt,skipabove=3pt,skipbelow=3pt]{examplebox}
\newenvironment{examples}[1][]{\begin{examplebox}\refstepcounter{examplesinner}{\color{exampleblue}\sffamily\bfseries Examples~\theexamplesinner\ifx\\#1\\\else\ (#1)\fi.}\,}{\end{examplebox}}
\renewcommand{\theHtheorem}{\thesection.\thesubsection.\arabic{theorem}}
\renewcommand{\theHlemma}{\thesection.\thesubsection.\arabic{lemma}}
\renewcommand{\theHcorollary}{\thesection.\thesubsection.\arabic{corollary}}
\renewcommand{\theHproposition}{\thesection.\thesubsection.\arabic{proposition}}
\renewcommand{\theHdefinition}{\thesection.\thesubsection.\arabic{definition}}
\renewcommand{\theHexamplesinner}{\thesection.\thesubsection.\arabic{examplesinner}}
\renewcommand{\theHremark}{\thesection.\thesubsection.\arabic{remark}}
\renewcommand{\theHresult}{\thesection.\thesubsection.\arabic{result}}
\newcommand{\E}{\mathbb{E}}
\newcommand{\Var}{\operatorname{Var}}
\newcommand{\Cov}{\operatorname{Cov}}
\renewcommand{\P}{\mathbb{P}}
\newcommand{\Q}{\mathbb{Q}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\N}{\mathcal{N}}
\newcommand{\F}{\mathcal{F}}
\newcommand{\G}{\mathcal{G}}
\newcommand{\A}{\mathcal{A}}
\newcommand{\B}{\mathcal{B}}
\newcommand{\Sc}{\mathcal{S}^c}
\newcommand{\Lp}{\mathcal{L}}
\newcommand{\indic}{\mathbf{1}}
\DeclareMathOperator{\sgn}{sgn}
\newcommand{\hblue}[1]{{\color{highlightblue}#1}}
\newcommand{\hred}[1]{{\color{highlightred}#1}}
\newcommand{\hgray}[1]{{\color{notegray}#1}}
\newcommand{\hsalmon}[1]{{\color{highlightsalmon}#1}}
\newcommand{\hgreen}[1]{{\color{highlightgreen}#1}}
\renewcommand{\qedsymbol}{$\blacksquare$}
\pagestyle{empty}
\geometry{a4paper, top=2cm, left=1cm, right=1cm}
\date{}
\title{Informal Measure Theory Notes}
\makeatletter\@ifpackageloaded{xcolor}{}{\usepackage{xcolor}}\makeatother
\definecolor{DeepNavy}{HTML}{00007B}
\hypersetup{
 pdfauthor={Aayush Bajaj},
 pdftitle={Informal Measure Theory Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)},
 pdflang={English},
 colorlinks=true,
 linkcolor=DeepNavy,
 urlcolor=DeepNavy
}\begin{document}

\pagestyle{fancy}
\begin{center}
{\bfseries \large Informal Measure Theory Notes} \\[0.5em]
April 2026
\end{center}
\tableofcontents
\newpage
\section{Probability Triples}
\label{sec:org827354a}

\begin{proposition}
The unique solution of the SDE
\[
dX_t = \mu(t, X_t) \, dt + \sigma(t, X_t) \cdot d\bm{W}_t
\]
with
\begin{align*}
\mu(t, X_t) &= A_t X_t + a_t, \\
\sigma(t, X_t) &= [B_t^1 X_t + b_t^1, \cdots, B_t^d X_t + b_t^d],
\end{align*}
where $A$, $a$, $B^i$, $b^i$ $(i = 1, \cdots, d)$ are all $\F$-adapted bounded processes, is given by the formula
\[
X_t = \Phi_t \left(X_0 + \int_0^t \Phi_u^{-1} [a_u - \bm{B}_u \cdot \bm{b}_u] \, du + \int_0^t \Phi_u^{-1} \bm{b}_u \cdot d\bm{W}_u\right)
\]
where
\[
\Phi_t = \exp\left(\int_0^t \left(A_u - \frac{\bm{B}_u \cdot \bm{B}_u}{2}\right) du + \int_0^t \bm{B}_u \cdot d\bm{W}_u\right).
\]
\end{proposition}

\begin{remark}
Analogous to ODE, we can consider the integration factor given by
\[
Y_t = \Phi_t^{-1} = \exp\left(-\int_0^t A_u \, du - \int_0^t \bm{B}_u \cdot d\bm{W}_u + \frac{1}{2} \int_0^t \bm{B}_u \cdot \bm{B}_u \, du\right)
\]
\end{remark}

\begin{proof}
To check that $X$ is a solution to the SDE, it suffices to differentiate the RHS using It\^o's formula (easier: compute $d(X_t Y_t)$). The uniqueness of solution can be deduced from It\^o's Theorem~(6.1.1).
\end{proof}
\end{document}
